# Lecture : Missing Data
Estimated time needed: **30** minutes

## Objectives

The aim of this notbeook is to give you an understanding of working with null values in the datasets. BY completion of this topic you will be able to handle

* Missing data points
* fill NA
* DROP NA when required
* usage of np.nan

___

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

##### Let's see a few convenient methods to deal with Missing Data in pandas:

* Dropping NUll values
* Mean Computation

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [4]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [6]:
df.fillna(value='-')

     A    B  C
0  1.0  5.0  1
1  2.0    -  2
2    -    -  3

In [17]:
mean_A = df['A'].mean()
df['A'].fillna(mean_A, inplace=True)

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [25]:
import time
start = time.time()
n=int(input("Input a number "))
d = dict()
for x in range(1,n+1):
    d[x]=x*x
print(pd.Series(d))
end = time.time()
print('Time : ', end-start,' ms')

Input a number 3
1    1
2    4
3    9
dtype: int64
Time :  0.6591148376464844  ms

In [23]:
def square(*x):
    import pandas as pd
    x = list(x)
    sq = [i**2 for i in x]
    di = pd.Series(dict(zip(x,sq)))
    print(di)

In [24]:
import time
start = time.time()
square(3, 4, 5)
end = time.time()
print('Time : ', end-start,' ms')

3     9
4    16
5    25
dtype: int64
Time :  0.002134084701538086  ms

In [20]:
np.arange(1,51)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])

____
___
<div class="alert alert-block alert-success">
<h2>Great Job!</h2>

That's all we need to know for now! Congratulations, you have learnt one more topic and hands-on with Python.This Notebook is prepared by <a href = 'https://www.linkedin.com/in/sumitkumarshukla'> Sumit Kumar Shukla</a>
</div>

_______